Tekla Open API Reference for Tekla Structures 2025
ViewHandler.GetTemporaryViews Method
Returns the temporary views.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ModelViewEnumerator GetTemporaryViews()
Public Shared Function GetTemporaryViews As ModelViewEnumerator
Return Value
Type: ModelViewEnumerator
A model view enumerator with the temporary views.
See Also
Reference
ViewHandler Class
Tekla.Structures.Model.UI Namespace